app/controllers/articles_controller.rb

SELECT `articles`.* FROM `articles` ORDER BY created_at asc
---
  def index
    @articles = Article.all

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 7 LIMIT 1
---
  def find_article
    @article = Article.find params[:id]